# -*- coding: utf-8 -*-
"""Копия блокнота "Копия блокнота "Практика 0.2.0 .ipynb""

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1rEmfwzVR_8Asjkez-63mNVoj37WROM7g

Напишите свое ФИО:
"""

Бурменский Дмитрий Викторович

"""# Основы

Задание 1: Напиши программу, выводящую на экран сообщение "Привет, мир!"
"""

print("Привет, мир!")

"""Задание 2: Напиши программу которая запрашивает имя пользователя и выводит сообщение:

`Привет, <Имя пользователя>`
"""

name = input('Введите имя:')
print('Привет,' , name)

"""Задание 3: Напиши программу определяющую является ли число четным или нечетным:

Пример:

`Введите число:` 2

`Ваше число четное!`
"""

num = int(input('Введите число:'))
if num%2 == 0:
  print('Ваше число четное!')
else:
  print("Число не четное :(")

"""Задание 4: Напишите программу которая запрашивает длинну и ширину прямоугольника и выводит его площадь:



`Введите длинну прямоугольника:`

`Введите ширину прямоугольника:`

`Площадь прямоугольника: `


"""

dlina = int(input('Введите длину прямоугольника:'))
shirina = int(input('Введите ширину прямоугольника:'))
print('Площадь прямоугольника:', dlina*shirina)

"""Задание 5: Напишите программу, которая будет вычислять среднее арифметическое введенных чисел"""

a = (input("введите чила через пробел:"))
a = a.split()
sum = 0
for i in a:
    sum+= int(i)
print('среднее арифметическое значение чисел:', sum/len(a))

"""Задание 6: Напиши программу, которая бы определяла является ли год високосным"""

god = int(input("введите год:"))
if str(god)[-2:] == '00':
    if god%400 == 0:
        print('год високосный')
    else:
        print('год не високосый')
else:
    if god%4 == 0:
        print('год високосный')
    else:
        print('год не високосый')

"""Задание 7: Необходимо создать простой калькулятор, который позволяет пользователю выбрать одну из четырёх операций (+, -, *, /), ввести два числа и получить результат выполнения операции."""

a1 = int(input('введите число 1:'))
a2 = int(input('введите число 2:'))
operator =  input('введите оператор:')

if operator == '+':
    print(a1 + a2)
elif operator == '-':
    print(a1 - a2)
elif operator == '*':
    print(a1 * a2)
elif operator == '/':
    print(a1 // a2)

"""# Практика 0.2.1

**Шахматы**

Даны стартовые и конечные координаты, а также фигура

Необходимо определить, может ли заданная фигура так ходить?
"""

x = '12345678'
y = '12345678'

def peshka(x, y):
    if x

"""# Практика 0.2.2

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции
"""



"""# Практика 0.2.3


Возьмите код из задания 7 и улучшите ваш калькулятор следующим образом:

Пользователь вводит строку вида:

(5+5)*5 - данная строка содержит в себе математическое выражение, а также скобки

Ваша программа должная понять что за математическое выражение записано, проверить верно ли оно записано (пример неверного заполнения: (5(+)5)*5, а также расчитать его в соотвествии с правилами математики
"""



